particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
    int end() {
        if (isEnabled()) {
            hal_gpio_config_t conf = {};
            conf.size = sizeof(conf);
            conf.version = HAL_GPIO_VERSION;
            conf.mode = OUTPUT_OPEN_DRAIN_PULLUP;
            conf.set_value = true;
            conf.value = 1;
            conf.drive_strength = HAL_GPIO_DRIVE_DEFAULT;
            hal_gpio_configure(sclPin_, &conf, nullptr);
            hal_gpio_configure(sdaPin_, &conf, nullptr);
            if (i2cInitStruct_.I2CMaster == I2C_SLAVE_MODE) {
                slaveIntConfigImpl(false);
            }
            enableImpl(false);
            state_ = HAL_I2C_STATE_DISABLED;
            // RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, DISABLE);
        }
        return SYSTEM_ERROR_NONE;
    }

    int suspend() {
        CHECK_TRUE(state_ = HAL_I2C_STATE_ENABLED, SYSTEM_ERROR_INVALID_STATE);
        CHECK(end());
        state_ = HAL_I2C_STATE_SUSPENDED;
        return SYSTEM_ERROR_NONE;
    }

    int restore() {
        CHECK_TRUE(state_ = HAL_I2C_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        return begin((i2cInitStruct_.I2CMaster == I2C_MASTER_MODE) ? I2C_MODE_MASTER : I2C_MODE_SLAVE, i2cInitStruct_.I2CAckAddr);
    }

    int reset() {
        end();

        // Just in case make sure that the pins are correctly configured (they should anyway be at this point)
        hal_gpio_config_t conf = {};
        conf.size = sizeof(conf);
        conf.version = HAL_GPIO_VERSION;
        conf.mode = OUTPUT_OPEN_DRAIN_PULLUP;
        conf.set_value = true;
        conf.value = 1;
        conf.drive_strength = HAL_GPIO_DRIVE_DEFAULT;
        hal_gpio_configure(sclPin_, &conf, nullptr);
        hal_gpio_configure(sdaPin_, &conf, nullptr);

        // Check if slave is stretching the SCL
        if (!WAIT_TIMED(HAL_I2C_DEFAULT_TIMEOUT_MS, hal_gpio_read(sclPin_) == 0)) {
            return SYSTEM_ERROR_I2C_BUS_BUSY;
        }

        // Generate up to 9 pulses on SCL to tell slave to release the bus
        for (int i = 0; i < 9; i++) {
            if (hal_gpio_read(sdaPin_) == 0) {
                hal_gpio_write(sclPin_, 0);
                HAL_Delay_Microseconds(50);
                hal_gpio_write(sclPin_, 1);
                HAL_Delay_Microseconds(50);
                hal_gpio_write(sclPin_, 0);
                HAL_Delay_Microseconds(50);
            } else {
                break;
            }
        }

        // Generate STOP condition: pull SDA low, switch to high
        hal_gpio_write(sdaPin_, 0);
        HAL_Delay_Microseconds(50);
        hal_gpio_write(sclPin_, 1);
        HAL_Delay_Microseconds(50);
        hal_gpio_write(sdaPin_, 1);
        HAL_Delay_Microseconds(50);

        hal_pin_set_function(sdaPin_, PF_I2C);
        hal_pin_set_function(sclPin_, PF_I2C);

        hal_i2c_mode_t mode = (i2cInitStruct_.I2CMaster  == I2C_MASTER_MODE) ? I2C_MODE_MASTER : I2C_MODE_SLAVE;
        begin(mode, i2cInitStruct_.I2CAckAddr);
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INTERNAL);
        return SYSTEM_ERROR_NONE;
    }

    int setSpeed(uint32_t speed) {
        bool enabled = isEnabled();
        if (enabled) {
            enableImpl(false);
            state_ = HAL_I2C_STATE_DISABLED;
        }
        i2cInitStruct_.I2CSpdMod = ((speed == CLOCK_SPEED_100KHZ) ? I2C_SS_MODE : I2C_FS_MODE);
        i2cInitStruct_.I2CClk    = ((speed == CLOCK_SPEED_100KHZ) ? 100 :
                                    (speed < CLOCK_SPEED_100KHZ && speed >= CLOCK_SPEED_10KHZ) ? CEIL_DIV(speed, 1000) : 400);
        if (enabled) {
            initImpl();
            enableImpl(true);
            state_ = HAL_I2C_STATE_ENABLED;
        }
        return SYSTEM_ERROR_NONE;
    }

    int setAddress(uint8_t address) {
        if (i2cInitStruct_.I2CAckAddr != address) {
            bool enabled = isEnabled();
            if (enabled) {
                enableImpl(false);
                state_ = HAL_I2C_STATE_DISABLED;
            }
            i2cInitStruct_.I2CAckAddr = address;
            if (enabled) {
                initImpl();
                enableImpl(true);
                state_ = HAL_I2C_STATE_ENABLED;
            }
        }
        return SYSTEM_ERROR_NONE;
    }

    ssize_t requestFrom(const hal_i2c_transmission_config_t* config) {
        if (i2cInitStruct_.I2CMaster != I2C_MASTER_MODE) {
            return 0;
        }
        rxBuffer_.reset();
        uint32_t quantity = std::min((size_t)config->quantity, rxBuffer_.size());

        // Dirty-hack: It may not generate the start signal when communicating with certain type of slave device.
        if (reEnableIfNeededImpl() != SYSTEM_ERROR_NONE) {
            return 0;
        }

        setAddress(config->address);

        bool waitStop = false;
        for (uint32_t i = 0; i < quantity; i++) {
            if (i >= quantity - 1) {
                waitStop = (config->flags & HAL_I2C_TRANSMISSION_FLAG_STOP);
                readByteTrigImpl(true, waitStop);
            } else {
                readByteTrigImpl(false, false);
            }
            if (WAIT_TIMED_ROUTINE(config->timeout_ms, isReadableImpl() == 0, isAbortedImpl) < 0) {
                reset();
                LOG_DEBUG(TRACE, "Wait RX data timeout");
                goto ret;
            }
            if (isAbortedImpl()) {
                LOG(TRACE, "Abort: %08X", abortSourceImpl());
                clearAllIntImpl();
                goto ret;
            }
            if (waitStop && !WAIT_TIMED(config->timeout_ms, !isStopDetectedImpl())) {
                reset();
                return SYSTEM_ERROR_I2C_STOP_TIMEOUT;
            }
            rxBuffer_.put(readByteImpl());
        }
    ret:
        return rxBuffer_.data();
    }

    ssize_t available() {
        return rxBuffer_.data();
    }

    uint8_t read() {
        uint8_t data = 0xFF;
        if (rxBuffer_.get(&data) != 1) {
            return 0xFF;
        }
        return data;
    }

    uint8_t peek() {
        uint8_t data = 0xFF;
        if (rxBuffer_.peek(&data) != 1) {
            return 0xFF;
        }
        return data;
    }

    void setConfigOrDefault(const hal_i2c_transmission_config_t* config, uint8_t address) {
        memset(&transConfig_, 0, sizeof(transConfig_));
        if (config) {
            memcpy(&transConfig_, config, std::min((size_t)config->size, sizeof(transConfig_)));
        } else {
            transConfig_ = {
                .size = sizeof(hal_i2c_transmission_config_t),
                .version = 0,
                .address = address,
                .reserved = {0},
                .quantity = 0,
                .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
                .flags = HAL_I2C_TRANSMISSION_FLAG_STOP,
                .buffer = nullptr
            };
        }
    }

    ssize_t write(uint8_t data) {
        txBuffer_.put(data);
        return 1;
    }

    int beginTransmission(uint8_t address, const hal_i2c_transmission_config_t* config) {
        setConfigOrDefault(config, address);
        txBuffer_.reset();
        return SYSTEM_ERROR_NONE;
    }

    int endTransmission(uint8_t stop, const hal_i2c_transmission_config_t* config = nullptr) {
        auto transConfig = transConfig_;
        if (config) {
            memset(&transConfig, 0, sizeof(transConfig));
            memcpy(&transConfig, config, std::min((size_t)config->size, sizeof(transConfig)));
        }
        SCOPE_GUARD({
            txBuffer_.reset();
        });
        if (i2cInitStruct_.I2CMaster != I2C_MASTER_MODE) {
            return SYSTEM_ERROR_INVALID_STATE;
        }

        // Dirty-hack: It may not generate the start signal when communicating with certain type of slave device.
        CHECK(reEnableIfNeededImpl());

        setAddress(transConfig_.address);

        uint32_t quantity = txBuffer_.data();
        if (quantity == 0) {
            return writeAddressOnlyImpl();
        }

        bool waitStop = false;
        for (uint32_t i = 0; i < quantity; i++) {
            if (!WAIT_TIMED(transConfig_.timeout_ms, isWritableImpl() == 0)) {
                reset();
                return SYSTEM_ERROR_I2C_FILL_DATA_TIMEOUT;
            }
            uint8_t data = 0xFF;
            if (txBuffer_.get(&data) != 1) {
                return SYSTEM_ERROR_NOT_ENOUGH_DATA;
            }
            if (i >= quantity - 1) {
                waitStop = stop;
                writeByteImpl(data, true, waitStop);
            } else {
                // The address will be sent before sending the first data byte
                writeByteImpl(data, false, false);
            }
            if (WAIT_TIMED_ROUTINE(transConfig_.timeout_ms, isTxFifoEmptyImpl() == 0, isAbortedImpl) < 0) {
                reset();
                return SYSTEM_ERROR_I2C_TX_DATA_TIMEOUT;
            }
            if (isAbortedImpl()) {
                LOG(TRACE, "Abort: %08X", abortSourceImpl());
                clearAllIntImpl();
                return SYSTEM_ERROR_CANCELLED;
            }
        }
        if (waitStop && !WAIT_TIMED(transConfig_.timeout_ms, !isStopDetectedImpl())) {
            reset();
            return SYSTEM_ERROR_I2C_STOP_TIMEOUT;
        }
        return SYSTEM_ERROR_NONE;
    }

