particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
    int transaction(const hal_i2c_transmission_config_t* txConfig, const hal_i2c_transmission_config_t* rxConfig) {
        // A quick hack for now with a temp copy
        particle::services::RingBuffer<uint8_t> txBuffer(txConfig ? txConfig->buffer : nullptr, txConfig ? txConfig->quantity : 0);
        particle::services::RingBuffer<uint8_t> rxBuffer(rxConfig ? rxConfig->buffer : nullptr, rxConfig ? rxConfig->quantity : 0);
        if (txConfig) {
            if (txConfig->quantity) {
                CHECK_TRUE(txConfig->buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
            }
            txBuffer.acquire(txConfig->quantity);
            txBuffer.acquireCommit(txConfig->quantity);
            std::swap(txBuffer, txBuffer_);
        }
        if (rxConfig) {
            if (rxConfig->quantity) {
                CHECK_TRUE(rxConfig->buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
            }
            std::swap(rxBuffer, rxBuffer_);
        }
        SCOPE_GUARD({
            if (txConfig) {
                std::swap(txBuffer, txBuffer_);
            }
            if (rxConfig) {
                std::swap(rxBuffer, rxBuffer_);
            }
        });
        if (txConfig) {
            CHECK(endTransmission(!!(txConfig->flags & HAL_I2C_TRANSMISSION_FLAG_STOP), txConfig));
        }
        if (rxConfig) {
            return requestFrom(rxConfig);
        }
        return 0;
    }

    void flush() {
        txBuffer_.reset();
        rxBuffer_.reset();
    }

    void setOnRequestedCallback(void (*function)(void)) {
        onRequested_ = function;
    }

    void setOnReceivedCallback(void (*function)(int)) {
        onReceived_ = function;
    }

    int lock() {
        if (mutex_ && !hal_interrupt_is_isr()) {
            return os_mutex_recursive_lock(mutex_);
        }
        return SYSTEM_ERROR_INVALID_STATE;
    }

    int unlock() {
        if (mutex_ && !hal_interrupt_is_isr()) {
            return os_mutex_recursive_unlock(mutex_);
        }
        return SYSTEM_ERROR_INVALID_STATE;
    }

    static I2cClass* getInstance(hal_i2c_interface_t i2c) {
        return getInstanceImpl(i2c);
    }

protected:
    I2cClass(hal_pin_t sda, hal_pin_t scl)
            : i2cInitStruct_(),
              sdaPin_(sda),
              sclPin_(scl),
              state_(HAL_I2C_STATE_NOT_INITIALIZED),
              slaveStatus_(I2C_SLAVE_STOPPED),
              heapBuffer_(false),
              onRequested_(nullptr),
              onReceived_(nullptr),
              mutex_(nullptr),
              slaveRxCache_(nullptr),
              slaveRxCacheLen_(0),
              slaveRxCacheDepth_(HAL_PLATFORM_I2C_BUFFER_SIZE(HAL_I2C_INTERFACE1) * 2) {
    }
    ~I2cClass() = default;

private:
    enum I2cSlaveStatus {
        I2C_SLAVE_STOPPED,
        I2C_SLAVE_STARTED,
        I2C_SLAVE_RESTARTED,
        I2C_SLAVE_TX,
        I2C_SLAVE_RX,
    };

    bool isConfigValid(const hal_i2c_config_t* config) {
        if ((config == nullptr) || (config->rx_buffer == nullptr || config->rx_buffer_size == 0 ||
                config->tx_buffer == nullptr || config->tx_buffer_size == 0)) {
            return false;
        }
        return true;
    }

    bool handleStartStop() {
        // These bits may be both set in single ISR
        // start | stop
        //   0   |   1    : STOPPED
        //   1   |   0    : RESTARTED
        //   1   |   1    : STOPPED -> STARTED (most likely happen) or RESTARTED -> STOPPED
        uint32_t intStatus = getIntStatusImpl();
        if (isIntStartDetectedImpl(intStatus) || isIntStopDetectedImpl(intStatus)) {
            clearStartDetectedIntImpl();
            clearStopDetectedIntImpl();
            if (isIntStartDetectedImpl(intStatus) && !isIntStopDetectedImpl(intStatus)) {
                slaveStatus_ = I2C_SLAVE_RESTARTED;
            } else if (isIntStartDetectedImpl(intStatus)) {
                slaveStatus_ = I2C_SLAVE_STARTED;
                // FIXME: It might be RESTARTED -> STOPPED
            } else {
                slaveStatus_ = I2C_SLAVE_STOPPED;
            }
            return true;
        }
        return false;
    }

    void slaveRxDone(size_t len, bool reset = false) {
        rxBuffer_.put(slaveRxCache_.get(), len);
        if (onReceived_) {
            onReceived_(rxBuffer_.data());
        }
        rxBuffer_.reset();
        if (reset) {
            memset(slaveRxCache_.get(), 0xFF, slaveRxCacheDepth_);
            slaveRxCacheLen_ = 0;
        } else {
            slaveRxCacheLen_ = slaveRxCacheLen_ - len;
            std::memmove(slaveRxCache_.get(), &slaveRxCache_[len], slaveRxCacheLen_);
        }
    }

    // Return:
    // 1: some of the read data belongs to next session
    // 0: all of the read data belongs the current session
    bool slaveRead() {
        uint16_t reportLen = 0;
        uint32_t intStatus;
        while (isReadableImpl()) {
            slaveRxCache_[slaveRxCacheLen_++] = (uint8_t)readByteImpl();
            intStatus = getIntStatusImpl();
            if (isIntStartDetectedImpl(intStatus) || isIntStopDetectedImpl(intStatus)) {
                reportLen = slaveRxCacheLen_;
                // We don't clear start/stop INT flag and keep reading data that is already in FIFO.
            }
        }
        if (reportLen > 0) {
            reportLen = std::min(rxBuffer_.size(), (size_t)slaveRxCacheLen_);
            slaveRxDone(reportLen);
            handleStartStop();
            return true;
        }
        return false;
    }

    void slaveWrite() {
        if (txBuffer_.data() <= 0) {
            if (onRequested_) {
                onRequested_();
            }
        }
        uint8_t data = 0xFF;
        if (txBuffer_.get(&data) == 1) {
            writeByteImpl(data, false, false);
        } else {
            writeByteImpl(0xFF, false, false);
        }
    }

    virtual void enableImpl(bool en) = 0;
    virtual void structInitImpl() = 0;
    virtual uint32_t getIntStatusImpl() = 0;
    virtual void clearAllIntImpl() = 0;
    virtual void clearReadRequestIntImpl() = 0;
    virtual void clearRxDoneIntImpl() = 0;
    virtual void clearStartDetectedIntImpl() = 0;
    virtual void clearStopDetectedIntImpl() = 0;
    virtual bool isIntRxFullImpl(uint32_t intStatus) = 0;
    virtual bool isIntReadRequestImpl(uint32_t intStatus) = 0;
    virtual bool isIntRxDoneImpl(uint32_t intStatus) = 0;
    virtual bool isIntStartDetectedImpl(uint32_t intStatus) = 0;
    virtual bool isIntStopDetectedImpl(uint32_t intStatus) = 0;
    virtual bool isReadableImpl() = 0;
    virtual bool isWritableImpl() = 0;
    virtual bool isTxFifoEmptyImpl() = 0;
    virtual bool isAbortedImpl() = 0;
    virtual bool isStopDetectedImpl() = 0;
    virtual uint32_t abortSourceImpl() = 0;
    virtual uint8_t readByteImpl() = 0;
    virtual void initImpl() = 0;
    virtual void slaveIntConfigImpl(bool en) = 0;
    virtual void readByteTrigImpl(bool lastByte, bool stop) = 0;
    virtual int writeAddressOnlyImpl() = 0;
    virtual void writeByteImpl(uint8_t data, bool lastByte, bool stop) = 0;
    virtual int reEnableIfNeededImpl() = 0;

protected:
    // WARNNING: critical timing section.
    static void i2cSlaveIntHandler(void* context) {
        auto instance = (I2cClass*)context;
        uint32_t intStatus = instance->getIntStatusImpl();

