particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
        switch (instance->slaveStatus_) {
            case I2C_SLAVE_STOPPED: {
                instance->handleStartStop();
                break;
            }
            case I2C_SLAVE_STARTED:
            case I2C_SLAVE_RESTARTED: {
                if (instance->isIntRxFullImpl(intStatus)) {
                    // Slave receiver
                    if (instance->slaveStatus_ == I2C_SLAVE_STARTED) {
                        memset(instance->slaveRxCache_.get(), 0xFF, instance->slaveRxCacheDepth_);
                        instance->slaveRxCacheLen_ = 0;
                    }
                    instance->slaveStatus_ = I2C_SLAVE_RX;
                    if (instance->slaveRead()) {
                        break;
                    }
                } else if (instance->isIntReadRequestImpl(intStatus)) {
                    // Slave transmitter
                    instance->clearReadRequestIntImpl();
                    instance->slaveStatus_ = I2C_SLAVE_TX;
                    instance->slaveWrite();
                }
                instance->handleStartStop();
                break;
            }
            case I2C_SLAVE_RX: {
                if (instance->isIntRxFullImpl(intStatus)) {
                    if (instance->slaveRead()) {
                        break;
                    }
                }
                if (instance->handleStartStop()) {
                    if (instance->slaveRxCacheLen_ > 0 && instance->onReceived_) {
                        instance->slaveRxDone(instance->slaveRxCacheLen_, true); // it will discard the data that cannot be filled
                    }
                }
                break;
            }
            case I2C_SLAVE_TX: {
                if (instance->isIntReadRequestImpl(intStatus)) {
                    instance->clearReadRequestIntImpl();
                    instance->slaveWrite();
                }
                if (instance->isIntRxDoneImpl(intStatus)) {
                    instance->clearRxDoneIntImpl();
                    instance->txBuffer_.reset();
                }
                if (instance->handleStartStop()) {
                    instance->txBuffer_.reset();
                }
                break;
            }
            default: break;
        }
    }

    I2C_InitTypeDef i2cInitStruct_;
    hal_i2c_transmission_config_t transConfig_;
    particle::services::RingBuffer<uint8_t> txBuffer_;
    particle::services::RingBuffer<uint8_t> rxBuffer_;

private:
    hal_pin_t sdaPin_;
    hal_pin_t sclPin_;

    volatile hal_i2c_state_t state_;
    volatile uint8_t slaveStatus_;

    bool heapBuffer_;

    void (*onRequested_)(void);
    void (*onReceived_)(int);

    os_mutex_recursive_t mutex_;

    std::unique_ptr<uint8_t[]> slaveRxCache_;
    volatile uint16_t slaveRxCacheLen_;
    uint16_t slaveRxCacheDepth_;
};

class I2cLock {
public:
    I2cLock() = delete;

    I2cLock(I2cClass* i2c)
            : i2c_(i2c) {
        i2c_->lock();
    }

    ~I2cLock() {
        i2c_->unlock();
    }

private:
    I2cClass* i2c_;
};

class LpI2cClass : public I2cClass {
public:
    LpI2cClass(hal_pin_t sda, hal_pin_t scl)
            : I2cClass(sda, scl) {
        i2cDev_ = I2C0_DEV;
    }

    ~LpI2cClass() = default;

    void enableImpl(bool en) override { I2C_Cmd(i2cDev_, en ? ENABLE : DISABLE); }
    void structInitImpl() override { I2C_StructInit(&i2cInitStruct_); }
    uint32_t getIntStatusImpl() override { return I2C_GetINT(i2cDev_); }
    void clearAllIntImpl() override { I2C_ClearAllINT(i2cDev_); }
    void clearReadRequestIntImpl() override { I2C_ClearINT(i2cDev_, BIT_IC_INTR_STAT_R_RD_REQ); }
    void clearRxDoneIntImpl() override { I2C_ClearINT(i2cDev_, BIT_IC_INTR_STAT_R_RX_DONE); }
    void clearStartDetectedIntImpl() override { I2C_ClearINT(i2cDev_, BIT_IC_INTR_STAT_R_START_DET); }
    void clearStopDetectedIntImpl() override { return I2C_ClearINT(i2cDev_, BIT_IC_INTR_STAT_R_STOP_DET); }
    bool isIntRxFullImpl(uint32_t intStatus) override { return (intStatus & BIT_IC_INTR_STAT_R_RX_FULL); }
    bool isIntReadRequestImpl(uint32_t intStatus) override { return (intStatus & BIT_IC_INTR_STAT_R_RD_REQ); }
    bool isIntRxDoneImpl(uint32_t intStatus) override { return (intStatus & BIT_IC_INTR_STAT_R_RX_DONE); }
    bool isIntStartDetectedImpl(uint32_t intStatus) override { return (intStatus & BIT_IC_INTR_STAT_R_START_DET); }
    bool isIntStopDetectedImpl(uint32_t intStatus) override { return (intStatus & BIT_IC_INTR_STAT_R_STOP_DET); }
    bool isReadableImpl() override { return I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_RFNE | BIT_IC_STATUS_RFF); }
    bool isWritableImpl() override { return I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_TFNF); }
    bool isTxFifoEmptyImpl() override { return I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_TFE); }
    bool isAbortedImpl() override { return (I2C_GetRawINT(i2cDev_) & BIT_IC_RAW_INTR_STAT_TX_ABRT); }
    bool isStopDetectedImpl() override { return (I2C_GetRawINT(i2cDev_) & BIT_IC_RAW_INTR_STAT_STOP_DET); }
    uint32_t abortSourceImpl() override { return i2cDev_->IC_TX_ABRT_SOURCE; }
    uint8_t readByteImpl() override { return i2cDev_->IC_DATA_CMD; }

    void initImpl() override {
        I2C_Init(i2cDev_, &i2cInitStruct_);
        // Enable restart function and set RX FIFO level
        i2cDev_->IC_CON |= BIT_CTRL_IC_CON_IC_RESTART_EN;
        i2cDev_->IC_RX_TL = std::min(rxBuffer_.size(), (size_t)0); // FIFO depth 1
    }

    void slaveIntConfigImpl(bool en) override {
        if (en) {
            InterruptRegister((IRQ_FUN)i2cSlaveIntHandler, I2C0_IRQ_LP, (uint32_t)this, 7);
            I2C_INTConfig(i2cDev_, (BIT_IC_INTR_MASK_M_START_DET | BIT_IC_INTR_MASK_M_RX_FULL | BIT_IC_INTR_MASK_M_STOP_DET |
                                    BIT_IC_INTR_MASK_M_RD_REQ | BIT_IC_INTR_MASK_M_RX_DONE), ENABLE);
            I2C_ClearAllINT(i2cDev_);
            InterruptEn(I2C0_IRQ_LP, 7);
        } else {
            InterruptDis(I2C0_IRQ_LP);
            InterruptUnRegister(I2C0_IRQ_LP);
            I2C_INTConfig(i2cDev_, (BIT_IC_INTR_MASK_M_START_DET | BIT_IC_INTR_MASK_M_RX_FULL | BIT_IC_INTR_MASK_M_STOP_DET |
                                    BIT_IC_INTR_MASK_M_RD_REQ | BIT_IC_INTR_MASK_M_RX_DONE), DISABLE);
        }
    }

    void readByteTrigImpl(bool lastByte, bool stop) override {
        if (!lastByte) {
            i2cDev_->IC_DATA_CMD = BIT_CTRL_IC_DATA_CMD_CMD;
            return;
        }
        if (stop) {
            i2cDev_->IC_DATA_CMD = BIT_CTRL_IC_DATA_CMD_CMD | BIT_CTRL_IC_DATA_CMD_STOP; // Generate stop signal
        } else {
            i2cDev_->IC_DATA_CMD = BIT_CTRL_IC_DATA_CMD_CMD | BIT_CTRL_IC_DATA_CMD_RESTART; // Generate restart signal
        }
    }

    int writeAddressOnlyImpl() override {
        // Clear flags
        uint32_t temp = i2cDev_->IC_CLR_TX_ABRT;
        temp = i2cDev_->IC_CLR_STOP_DET;
        (void)temp;
        if ((i2cDev_->IC_TX_ABRT_SOURCE & BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK)
            || isStopDetectedImpl()) {
            return SYSTEM_ERROR_I2C_ABORT;
        }
        // Send the slave address only
        i2cDev_->IC_DATA_CMD = (transConfig_.address << 1) | BIT_CTRL_IC_DATA_CMD_NULLDATA | BIT_CTRL_IC_DATA_CMD_STOP;
        // If slave is not detected, the STOP_DET bit won't be set, and the TX_ABRT is set instead.
        if (!WAIT_TIMED(transConfig_.timeout_ms, ((i2cDev_->IC_TX_ABRT_SOURCE & BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK) == 0)
                                              && (!isStopDetectedImpl()))) {
            return SYSTEM_ERROR_I2C_TX_ADDR_TIMEOUT;
        }
        if (i2cDev_->IC_TX_ABRT_SOURCE & BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK) {
            return SYSTEM_ERROR_I2C_ABORT;
        }
        return SYSTEM_ERROR_NONE;
    }

    void writeByteImpl(uint8_t data, bool lastByte, bool stop) override {
        if (!lastByte) {
            i2cDev_->IC_DATA_CMD = data;
            return;
        }
        if (stop) {
            i2cDev_->IC_DATA_CMD = data | BIT_CTRL_IC_DATA_CMD_STOP;
        } else {
            i2cDev_->IC_DATA_CMD = data | BIT_CTRL_IC_DATA_CMD_RESTART;
        }
    }

    int reEnableIfNeededImpl() override {
        if (!((i2cDev_->IC_RAW_INTR_STAT & BIT_IC_RAW_INTR_STAT_START_DET) &&
              !(i2cDev_->IC_RAW_INTR_STAT & BIT_IC_RAW_INTR_STAT_STOP_DET) &&
              (i2cDev_->IC_RAW_INTR_STAT & BIT_IC_RAW_INTR_STAT_ACTIVITY))) {
            i2cDev_->IC_ENABLE |= 0x00000002; // Abort the current transfer without flush Tx/Rx FIFO
            I2C_Cmd(i2cDev_, DISABLE);
            if (!WAIT_TIMED(transConfig_.timeout_ms, (i2cDev_->IC_ENABLE_STATUS & 0x00000001) == 1)) {
                reset();
                LOG_DEBUG(TRACE, "SYSTEM_ERROR_I2C_BUS_BUSY");
                return SYSTEM_ERROR_I2C_BUS_BUSY;
            }
            I2C_Cmd(i2cDev_, ENABLE);
            if (!WAIT_TIMED(transConfig_.timeout_ms, (i2cDev_->IC_ENABLE_STATUS & 0x00000001) == 0)) {
                return SYSTEM_ERROR_INTERNAL;
            }
        }
        clearAllIntImpl();
        return SYSTEM_ERROR_NONE;
    }

