particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
private:
    I2C_TypeDef* i2cDev_;
};

#if HAL_PLATFORM_I2C2
class UsiI2cClass : public I2cClass {
public:
    UsiI2cClass(hal_pin_t sda, hal_pin_t scl)
            : I2cClass(sda, scl) {
        usiDev_ = USI0_DEV;
    }

    ~UsiI2cClass() = default;

    void enableImpl(bool en) override { USI_I2C_Cmd(usiDev_, en ? ENABLE : DISABLE); }
    void structInitImpl() override { USI_I2C_StructInit((USI_I2C_InitTypeDef*)&i2cInitStruct_); } // Memory layout of USI_I2C_InitTypeDef is compatible with I2C_InitTypeDef
    uint32_t getIntStatusImpl() override { return USI_I2C_GetINT(usiDev_); }
    void clearAllIntImpl() override { USI_I2C_ClearAllINT(usiDev_); }
    void clearReadRequestIntImpl() override { USI_I2C_ClearINT(usiDev_, USI_I2C_RD_REQ_INTS); }
    void clearRxDoneIntImpl() override { USI_I2C_ClearINT(usiDev_, USI_I2C_RX_DONE_INTS); }
    void clearStartDetectedIntImpl() override { USI_I2C_ClearINT(usiDev_, USI_I2C_START_DET_INTS); }
    void clearStopDetectedIntImpl() override { return USI_I2C_ClearINT(usiDev_, USI_I2C_STOP_DET_INTS); }
    bool isIntRxFullImpl(uint32_t intStatus) override { return (intStatus & USI_RXFIFO_ALMOST_FULL_INTS); }
    bool isIntReadRequestImpl(uint32_t intStatus) override { return (intStatus & USI_I2C_RD_REQ_INTS); }
    bool isIntRxDoneImpl(uint32_t intStatus) override { return (intStatus & USI_I2C_RX_DONE_INTS); }
    bool isIntStartDetectedImpl(uint32_t intStatus) override { return (intStatus & USI_I2C_START_DET_INTS); }
    bool isIntStopDetectedImpl(uint32_t intStatus) override { return (intStatus & USI_I2C_STOP_DET_INTS); }
    bool isReadableImpl() override { return USI_I2C_CheckRXFIFOState(usiDev_, USI_RXFIFO_EMPTY) != 1; }
    bool isWritableImpl() override { return USI_I2C_CheckTXFIFOState(usiDev_, USI_TXFIFO_EMPTY | USI_TXFIFO_ALMOST_EMPTY_COPY); }
    bool isTxFifoEmptyImpl() override { return USI_I2C_CheckTXFIFOState(usiDev_, USI_TXFIFO_EMPTY); }
    bool isAbortedImpl() override { return (USI_I2C_GetRawINT(usiDev_) & USI_I2C_TX_ABRT_RSTS); }
    bool isStopDetectedImpl() override { return (USI_I2C_GetRawINT(usiDev_) & USI_I2C_STOP_DET_RSTS); }
    uint32_t abortSourceImpl() override { return usiDev_->I2C_TX_ABRT_SOURCE; }
    uint8_t readByteImpl() override { return usiDev_->RX_FIFO_READ; }

    void initImpl() override {
        USI_I2C_Init(usiDev_, (USI_I2C_InitTypeDef*)&i2cInitStruct_);
        // Enable restart function and set RX FIFO level
        usiDev_->I2C_CTRL |= (1 << 1);
        usiDev_->RX_FIFO_CTRL = std::min(rxBuffer_.size(), (size_t)0); // FIFO depth 1
    }

    void slaveIntConfigImpl(bool en) override {
        if (en) {
            InterruptRegister((IRQ_FUN)i2cSlaveIntHandler, USI_IRQ, (uint32_t)this, 7);
            USI_I2C_INTConfig(usiDev_, (USI_I2C_START_DET_INTER_EN | USI_RXFIFO_ALMOST_FULL_INTR_EN | USI_I2C_STOP_DET_INTER_EN |
                                    USI_I2C_RD_REQ_INTER_EN | USI_I2C_RX_DONE_INTER_EN), ENABLE);
            USI_I2C_ClearAllINT(usiDev_);
            InterruptEn(USI_IRQ, 7);
        } else {
            InterruptDis(USI_IRQ);
            InterruptUnRegister(USI_IRQ);
        }
    }

    void readByteTrigImpl(bool lastByte, bool stop) override {
        if (!lastByte) {
            usiDev_->TX_FIFO_WRITE = BIT_CTRL_IC_DATA_CMD_CMD;
            return;
        }
        if (stop) {
            usiDev_->TX_FIFO_WRITE = BIT_CTRL_IC_DATA_CMD_CMD | BIT_CTRL_IC_DATA_CMD_STOP; // Generate stop signal
        } else {
            usiDev_->TX_FIFO_WRITE = BIT_CTRL_IC_DATA_CMD_CMD | BIT_CTRL_IC_DATA_CMD_RESTART; // Generate restart signal
        }
    }

    int writeAddressOnlyImpl() override {
        // Clear flags
        usiDev_->INTERRUPT_STATUS_CLR = USI_I2C_TX_ABRT_CLR | USI_I2C_STOP_DET_CLR;
        // Send the slave address only
        usiDev_->TX_FIFO_WRITE = (transConfig_.address << 1) | (1 << 11) | (1 << 9);
        // If slave is not detected, the STOP_DET bit won't be set, and the TX_ABRT is set instead.
        if (!WAIT_TIMED(transConfig_.timeout_ms, ((usiDev_->I2C_TX_ABRT_SOURCE & USI_I2C_ABRT_7B_ADDR_NOACK) == 0)
                                                 && (!isStopDetectedImpl()))) {
            return SYSTEM_ERROR_I2C_TX_ADDR_TIMEOUT;
        }
        if (usiDev_->I2C_TX_ABRT_SOURCE & USI_I2C_ABRT_7B_ADDR_NOACK) {
            return SYSTEM_ERROR_I2C_ABORT;
        }
        return SYSTEM_ERROR_NONE;
    }

    void writeByteImpl(uint8_t data, bool lastByte, bool stop) override {
        if (!lastByte) {
            usiDev_->TX_FIFO_WRITE = data;
            return;
        }
        if (stop) {
            usiDev_->TX_FIFO_WRITE = data | BIT_CTRL_IC_DATA_CMD_STOP;
        } else {
            usiDev_->TX_FIFO_WRITE = data | BIT_CTRL_IC_DATA_CMD_RESTART;
        }
    }

    int reEnableIfNeededImpl() override {
        return SYSTEM_ERROR_NONE;
    }

private:
    USI_TypeDef* usiDev_;
};
#endif

static LpI2cClass i2c0(SDA, SCL);
#if HAL_PLATFORM_I2C2
static UsiI2cClass i2c1(PMIC_SDA, PMIC_SCL);
#endif

I2cClass* getInstanceImpl(hal_i2c_interface_t i2c) {
    static I2cClass* i2cs[] = {
        &i2c0
#if HAL_PLATFORM_I2C2
        ,&i2c1
#endif
    };
    CHECK_TRUE(i2c < sizeof(i2cs) / sizeof(i2cs[0]), nullptr);
    return i2cs[i2c];
}

int hal_i2c_init(hal_i2c_interface_t i2c, const hal_i2c_config_t* config) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    return instance->init(config);
}

void hal_i2c_set_speed(hal_i2c_interface_t i2c, uint32_t speed, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->setSpeed(speed);
}

void hal_i2c_stretch_clock(hal_i2c_interface_t i2c, bool stretch, void* reserved) {
    // always enabled
}

void hal_i2c_begin(hal_i2c_interface_t i2c, hal_i2c_mode_t mode, uint8_t address, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->begin(mode, address);
}

void hal_i2c_end(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    if (hal_i2c_is_enabled(i2c, nullptr)) {
        instance->end();
    }
}

uint32_t hal_i2c_request(hal_i2c_interface_t i2c, uint8_t address, uint8_t quantity, uint8_t stop, void* reserved) {
    hal_i2c_transmission_config_t conf = {
        .size = sizeof(hal_i2c_transmission_config_t),
        .version = 0,
        .address = address,
        .reserved = {0},
        .quantity = quantity,
        .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
        .flags = (uint32_t)(stop ? HAL_I2C_TRANSMISSION_FLAG_STOP : 0),
        .buffer = nullptr
    };
    return hal_i2c_request_ex(i2c, &conf, nullptr);
}

int32_t hal_i2c_request_ex(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* config, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), 0);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr) || !config) {
        return 0;
    }
    return instance->requestFrom(config);
}

void hal_i2c_begin_transmission(hal_i2c_interface_t i2c, uint8_t address, const hal_i2c_transmission_config_t* config) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return;
    }
    instance->beginTransmission(address, config);
}

