particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
uint8_t hal_i2c_end_transmission(hal_i2c_interface_t i2c, uint8_t stop, void* reserved) {
    return hal_i2c_compat_error_from(hal_i2c_end_transmission_ext(i2c, stop, reserved));
}

int hal_i2c_end_transmission_ext(hal_i2c_interface_t i2c, uint8_t stop, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_INVALID_ARGUMENT);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->endTransmission(stop);
}

uint32_t hal_i2c_write(hal_i2c_interface_t i2c, uint8_t data, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), 0);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return 0;
    }
    return instance->write(data);
}

int32_t hal_i2c_available(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->available();
}

int32_t hal_i2c_read(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->read();
}

int32_t hal_i2c_peek(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->peek();
}

void hal_i2c_flush(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return;
    }
    instance->flush();
}

bool hal_i2c_is_enabled(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), false);
    I2cLock lk(instance);
    return instance->isEnabled();
}

void hal_i2c_set_callback_on_received(hal_i2c_interface_t i2c, void (*function)(int),void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->setOnReceivedCallback(function);
}

void hal_i2c_set_callback_on_requested(hal_i2c_interface_t i2c, void (*function)(void),void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->setOnRequestedCallback(function);
}

void hal_i2c_enable_dma_mode(hal_i2c_interface_t i2c, bool enable, void* reserved) {
    // use DMA to send data by default
}

int hal_i2c_reset(hal_i2c_interface_t i2c, uint32_t reserved, void* reserved1) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    return instance->reset();
}

int32_t hal_i2c_lock(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    return instance->lock();
}

int32_t hal_i2c_unlock(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    return instance->unlock();
}

int hal_i2c_sleep(hal_i2c_interface_t i2c, bool sleep, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (sleep) {
        return instance->suspend();
    } else {
        return instance->restore();
    }
    return SYSTEM_ERROR_NONE;
}

int hal_i2c_transaction(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* tx_config, const hal_i2c_transmission_config_t* rx_config, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->transaction(tx_config, rx_config);
}
